#+TITLE: GTD
#+AUTHOR: guanghui
#+TAGS: { WORK(w) Emacs(e)  DREAM(d) OTHER(o)  PROJECT(p) MEETING(m) Daily(y) Weekly(x) Monthly(z)}

* FireBall                                                          :PROJECT:
:PROPERTIES:
:CATEGORY: cocos2d-x
:END:
** DONE [#A] 融合 Sale9Sprite 到 Sprite 中                            :WORK:
CLOSED: [2015-10-22 Thu 17:51] SCHEDULED: <2015-10-17 Fri 15:00>
- State "DONE"       from "STARTED"    [2015-10-22 Thu 17:51]
:LOGBOOK:
CLOCK: [2015-10-22 Thu 09:37]--[2015-10-22 Thu 10:02] =>  0:25
CLOCK: [2015-10-21 Wed 14:46]--[2015-10-21 Wed 15:11] =>  0:25
CLOCK: [2015-10-21 Wed 10:06]--[2015-10-21 Wed 10:31] =>  0:25
CLOCK: [2015-10-20 Tue 17:51]--[2015-10-20 Tue 18:16] =>  0:25
CLOCK: [2015-10-20 Tue 15:17]--[2015-10-20 Tue 15:42] =>  0:25
CLOCK: [2015-10-20 Tue 14:47]--[2015-10-20 Tue 15:12] =>  0:25
CLOCK: [2015-10-20 Tue 14:13]--[2015-10-20 Tue 14:38] =>  0:25
CLOCK: [2015-10-20 Tue 11:16]--[2015-10-20 Tue 11:41] =>  0:25
CLOCK: [2015-10-20 Tue 10:18]--[2015-10-20 Tue 10:43] =>  0:25
CLOCK: [2015-10-20 Tue 09:48]--[2015-10-20 Tue 10:13] =>  0:25
CLOCK: [2015-10-16 Fri 20:12]--[2015-10-16 Fri 20:37] =>  0:25
CLOCK: [2015-10-16 Fri 17:25]--[2015-10-16 Fri 17:50] =>  0:25
CLOCK: [2015-10-16 Fri 16:49]--[2015-10-16 Fri 17:14] =>  0:25
CLOCK: [2015-10-16 Fri 14:09]--[2015-10-16 Fri 14:34] =>  0:25
CLOCK: [2015-10-16 Fri 10:10]--[2015-10-16 Fri 10:35] =>  0:25
CLOCK: [2015-10-15 Thu 10:52]--[2015-10-15 Thu 11:17] =>  0:25
CLOCK: [2015-10-15 Thu 10:17]--[2015-10-15 Thu 10:42] =>  0:25
CLOCK: [2015-10-14 Wed 14:46]--[2015-10-14 Wed 15:11] =>  0:25
:END:
*** API Changs?
1. Add some APIs :
   - create(filename, capInsets);
   - create(texture, capInsets);
   - create(spriteFrame, capInsets);
2. create(spriteFrameName, capInsets);

3. Enable Sprite Effects:  setState / getState
   
4. Add a new API:  setPreferredSize

5. capInsets could be set individually

6. Add a Sprite type. All the renderer commands are selected based on the type.
   Sprite Type could be: Simple, Sliced, Tiled, Filled(ProgressTimer).

7. The flip behavior should be all the same? only flip the texture but not transforms?

*** Sprite Rendering Process.
- All the APIs change some data related to triangles commands
- For every data change, don't try to reset the triangles, just keep the value.
- Only before changing the Sprite type then compute all the triangles 
- Compute each vertex's transforms, color and texture's coordinate
- Triangles Array (Vertex, Color, Texture Coordinate)

*** Hacking the draw method.
1. convert two triangles to 9 triangles according to Sprite::Type and other sliced sprite infor.


:LOGBOOK:
CLOCK: [2015-10-14 Wed 17:10]--[2015-10-14 Wed 17:35] =>  0:25
CLOCK: [2015-10-14 Wed 16:33]--[2015-10-14 Wed 16:58] =>  0:25
CLOCK: [2015-10-14 Wed 16:19]--[2015-10-14 Wed 16:33] =>  0:14
CLOCK: [2015-10-14 Wed 15:17]--[2015-10-14 Wed 15:42] =>  0:25
CLOCK: [2015-10-14 Wed 14:18]--[2015-10-14 Wed 14:46] =>  0:28
CLOCK: [2015-10-14 Wed 11:05]--[2015-10-14 Wed 11:30] =>  0:25
:END:

** TODO [#B]  Learn some how to extend Unity new GUI.                 :WORK:

1. Understand the source code 

2. Tweak the Source code 

3. Learn how to extend the editor.
** TODO [#B]  Learn Typescript and Egret GUI and Pixi GUI             :WORK:
1. Learn some basic Typescript and set Emacs MacOS X dev env

2. Learn Egret GUI and write some code.

3. Learn Pixi GUI and write some code


* Zilongshanren                                               :DREAM:PROJECT:
:PROPERTIES:
:CATEGORY: zilongshanren
:END:
** Reading                                                         
*** STARTED [#B]  Learn Javascript [22%]                        :Daily:DREAM:
SCHEDULED: <2015-10-12 Mon 21:00 .+1d>
:PROPERTIES:
:CATEGORY: zilongshanren
:END:
- [X] https://developer.mozilla.org/en-US/docs/Web/JavaScript/A_re-introduction_to_JavaScript
- [X] http://tagtree.io/courses/expert-es6/do
- [ ] https://watchandcode.com/courses/eloquent-javascript-the-annotated-version/lectures/292229
- [ ][[file:~/Documents/%5BO'Reilly%20Media%5D%20Functional%20JavaScript.pdf][Functional Javascript]] 
- [ ] http://addyosmani.com/resources/essentialjsdesignpatterns/book/
- [ ] http://exploringjs.com/es6/
- [ ] https://github.com/getify/You-Dont-Know-JS
- [ ] https://leanpub.com/javascriptallongesix/read#leanpub-auto-decaffeinated-impostors
- [ ] https://github.com/MostlyAdequate/mostly-adequate-guide
:PROPERTIES:
:LAST_REPEAT: [2015-10-11 Sun 18:15]
:END:
- State "DONE"       from "STARTED"    [2015-10-11 Sun 18:15]
:LOGBOOK:
CLOCK: [2015-10-30 Fri 14:47]--[2015-10-30 Fri 15:12] =>  0:25
CLOCK: [2015-10-30 Fri 14:13]--[2015-10-30 Fri 14:38] =>  0:25
CLOCK: [2015-10-30 Fri 11:37]--[2015-10-30 Fri 12:02] =>  0:25
CLOCK: [2015-10-14 Wed 21:20]--[2015-10-14 Wed 21:45] =>  0:25
CLOCK: [2015-10-14 Wed 20:38]--[2015-10-14 Wed 21:03] =>  0:25
CLOCK: [2015-10-14 Wed 20:04]--[2015-10-14 Wed 20:29] =>  0:25
CLOCK: [2015-10-11 Sun 17:50]--[2015-10-12 Mon 13:31] => 19:41
:END:

*** TODO Learn WebGL and Graphics [0%]                        :Daily:DREAM:
SCHEDULED: <2015-10-27 22:30 .+1d Tue>
:PROPERTIES:
:CATEGORY: zilongshanren
:LAST_REPEAT: [2015-10-27 Tue 09:21]
:END:
- State "DONE"       from "TODO"       [2015-10-27 Tue 09:21]
- State "DONE"       from "STARTED"    [2015-10-17 Sat 10:06]
:LOGBOOK:
CLOCK: [2015-10-15 Thu 23:32]--[2015-10-15 Thu 23:57] =>  0:25
:END:
- [ ] https://www.udacity.com/course/interactive-3d-graphics--cs291
- [ ] [[file:~/Documents/WebGL%20Programming%20Guide.pdf][WebGL programming Guide]] 
- [ ] http://learningwebgl.com/blog/?page_id=1217
- [ ] http://www.webglacademy.com/courses.php
- [ ][[file:~/Documents/3D+Math+Primer+for+graphics+and+game+development.pdf][ Learn 3D Math]]
- [ ][[ file:~/Documents/Interactive%20Computer%20Graphics%206th.pdf]] 
- [ ] http://www.realtimerendering.com/blog/webgl-debugging-and-profiling-tools/

Reference:
https://tsherif.wordpress.com/2015/10/05/from-web-to-webgl-a-guide-for-web-developers-entering-the-third-dimension/


*** TODO   Read <<SCIP>> books                           
:PROPERTIES:
:END:
   :LOGBOOK:  
   CLOCK: [2015-06-03 Wed 14:31]--[2015-06-03 Wed 14:56] =>  0:25
   CLOCK: [2015-06-02 Tue 10:49]--[2015-06-02 Tue 11:14] =>  0:25
   :END:      
:PROPERTIES:
:LAST_REPEAT: [2015-06-03 Wed 16:39]
:CATEGORY: zilongshanren
:END:

*** TODO  Learn <<Algorithm>> 
:PROPERTIES:
:END:
   :LOGBOOK:
   CLOCK: [2014-10-03 Fri 22:23]--[2014-10-03 Fri 22:48] =>  0:25
   CLOCK: [2014-09-17 Wed 21:51]--[2014-09-17 Wed 22:16] =>  0:25
   CLOCK: [2014-09-16 Tue 21:56]--[2014-09-16 Tue 22:21] =>  0:25
   CLOCK: [2014-09-16 Tue 21:26]--[2014-09-16 Tue 21:51] =>  0:25
   CLOCK: [2014-04-08 Tue 20:52]--[2014-04-08 Tue 21:17] =>  0:25
   CLOCK: [2014-04-01 Tue 22:25]--[2014-04-01 Tue 22:50] =>  0:25
   CLOCK: [2014-03-29 Sat 22:19]--[2014-03-29 Sat 22:32] =>  0:13
   CLOCK: [2014-03-28 Fri 22:14]--[2014-03-28 Fri 22:39] =>  0:25
   CLOCK: [2014-03-28 Fri 21:44]--[2014-03-28 Fri 22:09] =>  0:25
   :END:
:PROPERTIES:
:CATEGORY: zilongshanren
:END:
** Side Project(非正式项目）                              
*** TODO [#C] Emacs Chinese Wubi Input Method                                 
:PROPERTIES:
:CATEGORY: zilongshanren
:END:
* Daily Tasks
#+category: Daily
** STARTED ListView 添加 Cell 复用  [100%]                            :WORK:
SCHEDULED: <2015-10-26 Mon 14:42>
:LOGBOOK:
CLOCK: [2015-10-27 Tue 14:37]--[2015-10-27 Tue 15:02] =>  0:25
CLOCK: [2015-10-27 Tue 14:07]--[2015-10-27 Tue 14:32] =>  0:25
:END:
** STARTED Learning  Clojure [%]                       :DREAM:Daily:clojure:
SCHEDULED: <2015-10-19 Mon 21:00 .+1d>
:PROPERTIES:
:LAST_REPEAT: [2015-10-18 Sun 22:59]
:END:
- State "DONE"       from "STARTED"    [2015-10-18 Sun 22:59]
:LOGBOOK:
CLOCK: [2015-10-23 Fri 21:55]--[2015-10-23 Fri 22:20] =>  0:25
CLOCK: [2015-10-19 Mon 23:03]--[2015-10-19 Mon 23:28] =>  0:25
CLOCK: [2015-10-18 Sun 20:23]--[2015-10-18 Sun 20:48] =>  0:25
CLOCK: [2015-10-18 Sun 17:46]--[2015-10-18 Sun 18:11] =>  0:25
CLOCK: [2015-10-18 Sun 17:06]--[2015-10-18 Sun 17:31] =>  0:25
CLOCK: [2015-10-18 Sun 16:29]--[2015-10-18 Sun 16:54] =>  0:25
:END:
- [ ] [[http://www.flyingmachinestudios.com/programming/to-the-printers/][Clojure for the Brave and True Is Off to the Printers!]]
- [ ] https://github.com/kovasb/gamma-driver
- [ ] https://github.com/sgrove/gamma-playground
- [ ] http://clojure.org/cheatsheet
- [ ] http://www.4clojure.com/problems
- [ ] https://github.com/clojure-cookbook/clojure-cookbook
4clojure answers
 https://github.com/jwalsh/4clojure-exercises/blob/master/src/exercises_4clojure/core.clj
  
 [2015-08-14 Fri 09:44]
** TODO  Learn basic Gulp                                             :WORK:
** TODO Visit Reddit                                            :Daily:WORK:
SCHEDULED: <2015-10-31 Sat 09:30-09:50 .+1d>
:PROPERTIES:
:LAST_REPEAT: [2015-10-30 Fri 11:35]
:END:
- State "DONE"       from "STARTED"    [2015-10-30 Fri 11:35]
- State "DONE"       from "STARTED"    [2015-10-29 Thu 13:33]
- State "DONE"       from "STARTED"    [2015-10-28 Wed 09:44]
- State "DONE"       from "STARTED"    [2015-10-27 Tue 13:36]
- State "DONE"       from "STARTED"    [2015-10-26 Mon 13:36]
- State "DONE"       from "TODO"       [2015-10-25 Sun 21:33]
:LOGBOOK:  
CLOCK: [2015-10-30 Fri 10:56]--[2015-10-30 Fri 11:21] =>  0:25
CLOCK: [2015-10-30 Fri 10:22]--[2015-10-30 Fri 10:47] =>  0:25
CLOCK: [2015-10-29 Thu 09:21]--[2015-10-29 Thu 09:46] =>  0:25
CLOCK: [2015-10-28 Wed 09:17]--[2015-10-28 Wed 09:42] =>  0:25
CLOCK: [2015-10-27 Tue 09:24]--[2015-10-27 Tue 09:49] =>  0:25
CLOCK: [2015-10-26 Mon 09:19]--[2015-10-26 Mon 09:44] =>  0:25
CLOCK: [2015-10-24 Sat 11:07]--[2015-10-24 Sat 11:32] =>  0:25
CLOCK: [2015-10-23 Fri 09:32]--[2015-10-23 Fri 09:57] =>  0:25
CLOCK: [2015-10-21 Wed 09:34]--[2015-10-21 Wed 09:59] =>  0:25
CLOCK: [2015-10-20 Tue 09:12]--[2015-10-20 Tue 09:37] =>  0:25
CLOCK: [2015-10-19 Mon 07:44]--[2015-10-19 Mon 08:09] =>  0:25
CLOCK: [2015-10-18 Sun 11:38]--[2015-10-18 Sun 12:03] =>  0:25
CLOCK: [2015-10-17 Sat 11:11]--[2015-10-17 Sat 11:36] =>  0:25
CLOCK: [2015-10-16 Fri 09:35]--[2015-10-16 Fri 10:00] =>  0:25
CLOCK: [2015-10-15 Thu 09:29]--[2015-10-15 Thu 09:56] =>  0:27
CLOCK: [2015-10-14 Wed 09:29]--[2015-10-14 Wed 09:54] =>  0:25
CLOCK: [2015-10-13 Tue 09:27]--[2015-10-13 Tue 09:52] =>  0:25
CLOCK: [2015-10-12 Mon 13:31]--[2015-10-12 Mon 13:56] =>  0:25
CLOCK: [2015-10-11 Sun 16:40]--[2015-10-11 Sun 17:05] =>  0:25
CLOCK: [2015-10-10 Sat 13:43]--[2015-10-10 Sat 14:08] =>  0:25
CLOCK: [2015-10-09 Fri 08:14]--[2015-10-09 Fri 08:39] =>  0:25
CLOCK: [2015-09-23 Wed 11:36]--[2015-09-23 Wed 11:54] =>  0:18
CLOCK: [2015-09-21 Mon 16:17]--[2015-09-21 Mon 16:42] =>  0:25
CLOCK: [2015-09-11 Fri 11:15]--[2015-09-11 Fri 11:19] =>  0:04
CLOCK: [2015-09-02 Wed 15:15]--[2015-09-02 Wed 15:40] =>  0:25
CLOCK: [2015-08-28 Fri 09:28]--[2015-08-28 Fri 09:53] =>  0:25
CLOCK: [2015-08-14 Fri 09:35]--[2015-08-14 Fri 10:00] =>  0:25
CLOCK: [2015-08-10 Mon 10:10]--[2015-08-10 Mon 10:35] =>  0:25
CLOCK: [2015-07-28 Tue 07:51]--[2015-08-04 Tue 09:17] => 169:26
CLOCK: [2015-07-28 Tue 07:49]--[2015-07-28 Tue 07:51] =>  0:02
CLOCK: [2015-07-17 Fri 09:58]--[2015-07-17 Fri 10:23] =>  0:25
CLOCK: [2015-07-15 Wed 09:30]--[2015-07-15 Wed 09:55] =>  0:25
CLOCK: [2015-07-03 Fri 14:17]--[2015-07-03 Fri 14:42] =>  0:25
CLOCK: [2015-06-25 Thu 09:20]--[2015-06-25 Thu 09:45] =>  0:25
CLOCK: [2015-06-24 Wed 09:34]--[2015-06-24 Wed 09:59] =>  0:25
CLOCK: [2015-06-17 Wed 09:57]--[2015-06-17 Wed 10:22] =>  0:25
CLOCK: [2015-06-15 Mon 09:50]--[2015-06-15 Mon 10:15] =>  0:25
CLOCK: [2015-06-11 Thu 17:38]--[2015-06-11 Thu 18:03] =>  0:25
CLOCK: [2015-06-08 Mon 10:43]--[2015-06-08 Mon 11:08] =>  0:25
CLOCK: [2015-06-05 Fri 09:25]--[2015-06-05 Fri 09:50] =>  0:25
CLOCK: [2015-06-02 Tue 09:39]--[2015-06-02 Tue 10:04] =>  0:25
CLOCK: [2015-05-05 Tue 11:14]--[2015-05-05 Tue 11:39] =>  0:25
CLOCK: [2015-05-04 Mon 10:32]--[2015-05-04 Mon 10:52] =>  0:20
CLOCK: [2015-05-04 Mon 09:48]--[2015-05-04 Mon 10:32] =>  0:44
:END:      
** TODO Read RSS half an  hour                                  :Daily:LIFE:
SCHEDULED: <2015-10-31 Sat 13:40 .+1d>
:PROPERTIES:
:LAST_REPEAT: [2015-10-30 Fri 14:13]
:END:
- State "DONE"       from "STARTED"    [2015-10-30 Fri 14:13]
- State "DONE"       from "STARTED"    [2015-10-29 Thu 15:03]
- State "DONE"       from "STARTED"    [2015-10-27 Tue 14:07]
- State "DONE"       from "STARTED"    [2015-10-26 Mon 14:40]
:LOGBOOK:  
CLOCK: [2015-10-30 Fri 13:43]--[2015-10-30 Fri 14:08] =>  0:25
CLOCK: [2015-10-29 Thu 13:33]--[2015-10-29 Thu 13:58] =>  0:25
CLOCK: [2015-10-28 Wed 13:43]--[2015-10-28 Wed 14:08] =>  0:25
CLOCK: [2015-10-27 Tue 13:36]--[2015-10-27 Tue 14:01] =>  0:25
CLOCK: [2015-10-26 Mon 13:36]--[2015-10-26 Mon 14:01] =>  0:25
CLOCK: [2015-10-22 Thu 13:32]--[2015-10-23 Fri 08:46] => 19:14
CLOCK: [2015-10-21 Wed 13:37]--[2015-10-21 Wed 14:02] =>  0:25
CLOCK: [2015-10-20 Tue 13:36]--[2015-10-20 Tue 14:01] =>  0:25
CLOCK: [2015-10-17 Sat 11:43]--[2015-10-17 Sat 12:08] =>  0:25
CLOCK: [2015-10-16 Fri 13:34]--[2015-10-17 Sat 11:11] => 21:37
CLOCK: [2015-10-14 Wed 13:33]--[2015-10-14 Wed 13:58] =>  0:25
CLOCK: [2015-10-13 Tue 09:59]--[2015-10-13 Tue 10:24] =>  0:25
CLOCK: [2015-10-11 Sun 17:12]--[2015-10-11 Sun 17:37] =>  0:25
CLOCK: [2015-08-05 Wed 15:39]--[2015-08-05 Wed 23:37] =>  7:58
CLOCK: [2015-07-18 Sat 15:49]--[2015-07-18 Sat 18:34] =>  2:45
CLOCK: [2015-07-06 Mon 13:36]--[2015-07-06 Mon 14:01] =>  0:25
CLOCK: [2015-06-25 Thu 15:42]--[2015-06-26 Fri 10:27] => 18:45
CLOCK: [2015-06-19 Fri 13:33]--[2015-06-19 Fri 13:58] =>  0:25
CLOCK: [2015-06-18 Thu 15:21]--[2015-06-18 Thu 15:46] =>  0:25
CLOCK: [2015-06-17 Wed 13:35]--[2015-06-17 Wed 14:00] =>  0:25
CLOCK: [2015-06-16 Tue 14:59]--[2015-06-16 Tue 15:24] =>  0:25
CLOCK: [2015-06-15 Mon 13:37]--[2015-06-15 Mon 13:49] =>  0:12
CLOCK: [2015-06-12 Fri 13:44]--[2015-06-12 Fri 14:09] =>  0:25
CLOCK: [2015-06-11 Thu 16:15]--[2015-06-11 Thu 16:40] =>  0:25
CLOCK: [2015-06-09 Tue 13:37]--[2015-06-09 Tue 14:02] =>  0:25
CLOCK: [2015-05-04 Mon 14:29]--[2015-05-04 Mon 14:54] =>  0:25
:END:      
** STARTED [#B] Fix node and scrollview nested issue                  :WORK:

** TODO [#C]  使用 Clojure 搭建一个 Emacs 社区                        :LIFE:

** TODO [#C]  替换 oh-my-zsh 为 antigen,同时为 cocos-console 编写一个 zsh 插件 :LIFE:
"https://github.com/shengyou/codeception-zsh-plugin/blob/master/codeception.plugin.zsh"
"https://askql.wordpress.com/2011/01/11/zsh-writing-own-completion/"
"https://joshldavis.com/2014/07/26/oh-my-zsh-is-a-disease-antigen-is-the-vaccine/"
"http://wikimatze.de/writing-zsh-completion-for-padrino/"

** TODO [#C]  Learn Org Dashboard to management my project, like reading a book or doing a side project. :Emacs:
"http://thehelpfulhacker.net/2014/07/19/a-dashboard-for-your-life-a-minimal-goal-tracker-using-org-mode-go-and-git/"

** DONE [#C] 学习 demo-it package 的用法，同时为我的 git 培训写一个 ppt :Emacs:
CLOSED: [2015-10-24 Sat 11:07] SCHEDULED: <2015-10-24 Sat 10:32>
- State "DONE"       from "STARTED"    [2015-10-24 Sat 11:07]
:LOGBOOK:
CLOCK: [2015-10-24 Sat 10:32]--[2015-10-24 Sat 11:07] =>  0:35
:END:
[[https://github.com/howardabrams/demo-it][howardabrams/demo-it]]

** TODO [#C]  使用 Emacs 进行项目管理                                 :Emacs:
"https://leiyue.wordpress.com/2012/07/04/use-org-mode-and-taskjuggler-to-manage-to-project-information/"
"http://www.devalot.com/articles/2008/07/project-planning"
"http://doc.norang.ca/org-mode.html"
"http://juanreyero.com/article/emacs/org-teams.html"
"http://blog.modelworks.ch/?p=129"

** TODO [#C]  学习 EDebug 和 Ert                                     :Emacs:
[[http://www.gnu.org/software/emacs/manual/html_node/ert/index.html][Emacs Lisp Regression Testing: Top]]
"http://www.gnu.org/software/emacs/manual/html_node/ert/index.html"

** TODO [#C]  Add Travis CI to my website                             :LIFE:

** TODO [#C] 研究 js2-mode 的各种妙用                                :Emacs:
[[http://blog.binchen.org/posts/why-emacs-is-better-editor.html][Why Emacs is better editor - a case study for javascript developer | Chen's blog]]
[[http://blog.binchen.org/posts/use-which-func-mode-with-js2-mode.html][Use which-func-mode with js2-mode | Chen's blog]]

** TODO [#C]  给 Org-insert-link 添加 Helm 接口,可以从所有的 Agenda Files 里面选择一个 Headline 并插件链接 :Emacs:

** TODO [#C] 设置 org-agenda 显示周末使用不同的字体,同时设置 org-agenda 显示中国的节日和亲朋好友的 :Emacs:
生日.使用 bbdb 来管理联系人的电话和生日.
[[http://emacs.stackexchange.com/questions/10871/programmatically-add-birthdays-holidays-to-agenda-view-in-org-mode][Programmatically add birthdays/holidays to agenda view in org-mode - Emacs Stack Exchange]]
[[http://emacs.stackexchange.com/questions/10965/easiest-way-to-customize-holidays-that-appear-in-org-agenda][calendar - Easiest way to customize holidays that appear in org-agenda - Emacs Stack Exchange]]
[[http://www.emacswiki.org/emacs/CalendarLocalization#toc20][EmacsWiki: Calendar Localization]]
[[http://xlambda.com/blog/2010/01/11/customize-calendar-in-emacs/][在 emacs calendar 中定制中国农历节日 - X lambda]]


** TODO [#C] Learn Phaser and Clojure
[[http://phaser.io/][Phaser - A fast, fun and free open source HTML5 game framework]]
[[https://github.com/dparis/phzr][dparis/phzr]]
[[https://www.reddit.com/r/Clojure/comments/3h6gso/phzr_a_clojurescript_wrapper_for_the_phaser_html5/][phzr - A ClojureScript wrapper for the Phaser HTML5 game framework : Clojure]]

** TODO  Read the Book <The Art of Unix Programming>
[[http://www.catb.org/esr/writings/taoup/html/index.html][The Art of Unix Programming]]

** TODO [#C]  Add Evil visual mark mode and related toggles          :Emacs:

** TODO  Learn Ploymer Starter Kit                                    :WORK:
https://developers.google.com/web/tools/polymer-starter-kit/

** TODO Do exercise for 30 minutes                              :Daily:LIFE:
SCHEDULED: <2015-10-26 Mon 21:00-21:30 .+1d>
:PROPERTIES:
:LAST_REPEAT: [2015-10-25 Sun 21:33]
:CATEGORY: daily
:END:
- State "DONE"       from "TODO"       [2015-10-25 Sun 21:33]
- State "DONE"       from "STARTED"    [2015-10-19 Mon 23:02]
- State "DONE"       from "STARTED"    [2015-10-15 Thu 22:33]
- State "DONE"       from "TODO"       [2015-10-13 Tue 11:22]
:LOGBOOK:
CLOCK: [2015-10-18 Sun 23:00]--[2015-10-18 Sun 23:25] =>  0:25
CLOCK: [2015-10-17 Sat 23:06]--[2015-10-17 Sat 23:31] =>  0:25
CLOCK: [2015-10-17 Sat 21:35]--[2015-10-17 Sat 21:38] =>  0:03
CLOCK: [2015-10-13 Tue 22:05]--[2015-10-14 Wed 09:29] => 11:24
CLOCK: [2015-10-08 Thu 21:15]--[2015-10-08 Thu 21:40] =>  0:25
:END:

** TODO Do exercise for 30 minutes                              :Daily:LIFE:
SCHEDULED: <2015-10-31 Sat 08:00 .+1d>
:PROPERTIES:
:LAST_REPEAT: [2015-10-30 Fri 10:22]
:END:
- State "DONE"       from "TODO"       [2015-10-30 Fri 10:22]
- State "DONE"       from "STARTED"    [2015-10-29 Thu 09:21]
- State "DONE"       from "TODO"       [2015-10-28 Wed 13:43]
- State "DONE"       from "TODO"       [2015-10-27 Tue 09:21]
- State "DONE"       from "STARTED"    [2015-10-26 Mon 09:19]
- State "DONE"       from "TODO"       [2015-10-25 Sun 22:38]
- State "DONE"       from "TODO"       [2015-10-24 Sat 10:32]
- State "DONE"       from "STARTED"    [2015-10-23 Fri 09:31]
- State "DONE"       from "TODO"       [2015-10-22 Thu 13:32]
- State "DONE"       from "TODO"       [2015-10-22 Thu 13:32]
- State "DONE"       from "TODO"       [2015-10-21 Wed 09:34]
- State "DONE"       from "TODO"       [2015-10-20 Tue 09:11]
- State "DONE"       from "TODO"       [2015-10-19 Mon 23:02]
- State "DONE"       from "STARTED"    [2015-10-18 Sun 11:38]
- State "DONE"       from "STARTED"    [2015-10-17 Sat 10:32]
- State "DONE"       from "STARTED"    [2015-10-16 Fri 09:29]
- State "DONE"       from "TODO"       [2015-10-15 Thu 09:29]
- State "DONE"       from "STARTED"    [2015-10-14 Wed 11:01]
- State "DONE"       from "TODO"       [2015-10-13 Tue 11:24]
- State "DONE"       from "TODO"       [2015-10-13 Tue 11:24]
- State "DONE"       from "TODO"       [2015-10-13 Tue 11:22]
:LOGBOOK:
CLOCK: [2015-10-29 Thu 08:14]--[2015-10-29 Thu 08:39] =>  0:25
CLOCK: [2015-10-26 Mon 08:08]--[2015-10-26 Mon 08:33] =>  0:25
CLOCK: [2015-10-23 Fri 08:46]--[2015-10-23 Fri 09:31] =>  0:45
CLOCK: [2015-10-18 Sun 11:06]--[2015-10-18 Sun 11:31] =>  0:25
CLOCK: [2015-10-17 Sat 09:37]--[2015-10-17 Sat 10:02] =>  0:25
CLOCK: [2015-10-16 Fri 08:32]--[2015-10-16 Fri 09:29] =>  0:57
CLOCK: [2015-10-16 Fri 08:07]--[2015-10-16 Fri 08:32] =>  0:25
CLOCK: [2015-10-14 Wed 10:27]--[2015-10-14 Wed 10:52] =>  0:25
CLOCK: [2015-10-08 Thu 21:15]--[2015-10-08 Thu 21:40] =>  0:25
:END:

** TODO [#B]  Learn 《the little scheme》 with javascript.           :DREAM:
use javascript to finish the exercises of the book.

** TODO [#C]  Make Emacs Javascript TDD more convenient 
http://eigenhombre.com/clojure/2014/07/20/a-worfklow-tdd-rdd-and-ddd/
https://github.com/jorgenschaefer/emacs-tdd

** TODO  Javascript Recursive exercises 
http://roman01la.github.io/recursion-exercises/

** TODO  Learn WebGL well and build a 3D Technical Tree.
It should be modular, so I could build a tree for Emacs, cocos etc.
http://skill.phodal.com/#_a2f_1_zilong

** TODO [#A]  Javascript Functional programming
https://lodash.com/docs#filter
https://www.ibm.com/developerworks/cn/web/1006_qiujt_jsfunctional/
http://blog.oyanglul.us/javascript/functional-javascript.html
https://drboolean.gitbooks.io/mostly-adequate-guide/content/ch1.html

The following links are articles.
http://www.ruanyifeng.com/blog/2012/04/functional_programming.html
http://coolshell.cn/articles/10822.html

** TODO [#C]  Learn how to use Emacs to compile, run and debug cocos2d-x

** TODO [#C]  Use applescript to toogle Input method.

https://discussions.apple.com/thread/5766798?tstart=0

** DONE [#A]  Refactoring of Scale9Sprite  
CLOSED: [2015-10-26 Mon 13:36]
- State "DONE"       from "TODO"       [2015-10-26 Mon 13:36]
1. Make a new class for compute the slice info.
2. Encapsulate some member access method for Sprite class.
  Such as _texture, _rect and _originalSize change.
3. Sale9Sprite override these methods and add it's own functionality.
4. Split the UV computation and Vertices computation.
5. Add setTriangles to polygonInfo.
6. Make a good name for the new class and it should return a triangle info. 

SCHEDULED: <2015-10-23 Fri 14:00>

** TODO  Write Android application with Clojure

** TODO [#C]  One Day I should use hexo + org as my blog generator

** DONE Review PageView customize code
CLOSED: [2015-10-29 Thu 18:40] SCHEDULED: <2015-10-29 Thu 16:00>
- State "DONE"       from "STARTED"    [2015-10-29 Thu 18:40]
:LOGBOOK:
CLOCK: [2015-10-29 Thu 15:53]--[2015-10-29 Thu 16:18] =>  0:25
:END:

* Weekly Tasks                                                       :Weekly:
#+category: Weekly
** TODO [#B]  Record a Spacemacs rocks video.                 :Emacs:Weekly:
SCHEDULED: <2015-10-31 Sat .+6d/7d>
:PROPERTIES:
:LAST_REPEAT: [2015-10-25 Sun 21:33]
:END:
- State "DONE"       from "STARTED"    [2015-10-25 Sun 21:33]
- State "DONE"       from "STARTED"    [2015-10-17 Sat 22:13]
:LOGBOOK:
CLOCK: [2015-10-25 Sun 20:05]--[2015-10-25 Sun 20:30] =>  0:25
CLOCK: [2015-10-17 Sat 22:07]--[2015-10-17 Sat 22:13] =>  0:06
:END:
- State "DONE"       from "TODO"       [2015-10-11 Sun 01:09]
- The video should be within 5 min.
- It should demo a specific feature of Spacemacs

*** DONE navigate your lisp code faster.
CLOSED: [2015-10-27 Tue 09:20]
- State "DONE"       from              [2015-10-27 Tue 09:20]
*** DONE Use org mode to management your time(GTD)
CLOSED: [2015-10-27 Tue 09:20]
- State "DONE"       from              [2015-10-27 Tue 09:20]
*** DONE c/c++ IDE
CLOSED: [2015-10-27 Tue 09:20]
- State "DONE"       from              [2015-10-27 Tue 09:20]
***  Python IDE
*** Javascript IDE
*** search and replace showcase(buffer, file, project)
:%s/string/replace/gc
c-c r  /  c-c q
 Show multiple editing.
(iedit)
(multiple cursor)

(helm-swoop/multiple file c-c c-e)
(helm-ag-this-file/project c-c c-e)
(occur e c-c c-c)
*** File, buffer, directory search and open
*** Magit
*** Blogging
*** Lispy


** TODO Update upstream from Spacemacs and update all the packages from melpa and fix possible issues
SCHEDULED: <2015-11-06 Fri .+7d/8d>
:PROPERTIES:
:LAST_REPEAT: [2015-10-30 Fri 11:35]
:END:
- State "DONE"       from "TODO"       [2015-10-30 Fri 11:35]
- State "DONE"       from "TODO"       [2015-10-22 Thu 18:33]
- State "DONE"       from "TODO"       [2015-10-15 Thu 09:29]
- State "DONE"       from "TODO"       [2015-10-08 Thu 11:39]
** TODO Write a Blog, no matter English or Chinese                    :LIFE:
SCHEDULED: <2015-11-01 Sun .+7d/8d>
:PROPERTIES:
:LAST_REPEAT: [2015-10-25 Sun 22:38]
:END:
- State "DONE"       from "STARTED"    [2015-10-25 Sun 22:38]
- State "DONE"       from "TODO"       [2015-10-15 Thu 09:29]
- State "DONE"       from "TODO"       [2015-09-23 Wed 11:54]
- State "DONE"       from "TODO"       [2015-09-23 Wed 11:54]
- State "DONE"       from "TODO"       [2015-09-23 Wed 11:54]
- State "DONE"       from "TODO"       [2015-09-23 Wed 11:54]
- State "DONE"       from "STARTED"    [2015-09-04 Fri 11:51]
- State "DONE"       from "TODO"       [2015-08-25 Tue 16:57]
- State "DONE"       from "TODO"       [2015-08-18 Tue 13:36]
- State "DONE"       from "TODO"       [2015-08-10 Mon 16:51]
- State "DONE"       from "TODO"       [2015-07-28 Tue 09:23]
- State "DONE"       from "TODO"       [2015-07-13 Mon 09:31]
- State "DONE"       from "TODO"       [2015-07-04 Sat 21:45]
- State "DONE"       from "TODO"       [2015-05-26 Tue 17:26]
   - State "DONE"       from "TODO"       [2015-03-12 Thu 18:05]
   - State "DONE"       from "TODO"       [2015-01-19 Mon 09:35]
   - State "DONE"       from "TODO"       [2014-09-30 Tue 08:23]
   - State "DONE"       from "TODO"       [2014-09-15 Mon 09:22]
   - State "DONE"       from "TODO"       [2014-09-08 Mon 23:28]
   - State "DONE"       from "TODO"       [2014-09-01 Mon 10:26]
   - State "DONE"       from "TODO"       [2014-08-25 Mon 09:18]
   - State "DONE"       from "TODO"       [2014-08-13 Wed 09:50]
  - State "DONE"       from "TODO"       [2014-08-02 Sat 07:00]
  :LOGBOOK:
CLOCK: [2015-10-25 Sun 21:33]--[2015-10-25 Sun 21:58] =>  0:25
CLOCK: [2015-08-30 Sun 22:55]--[2015-08-30 Sun 23:20] =>  0:25
  CLOCK: [2014-03-30 Sun 22:45]--[2014-03-30 Sun 22:57] =>  0:12
  :END:
:PROPERTIES:
:LAST_REPEAT: [2015-08-25 Tue 16:57]
:END:
** TODO Keep in touch with family                                     :LIFE:
:PROPERTIES:
:LAST_REPEAT: [2015-10-25 Sun 22:38]
:END:
- State "DONE"       from "TODO"       [2015-10-25 Sun 22:38]
- State "DONE"       from "TODO"       [2015-10-15 Thu 09:29]
SCHEDULED: <2015-11-01 Sun 10:00-10:30 .+7d/8d>
:PROPERTIES:
:LAST_REPEAT: [2015-10-06 Tue 20:43]
:END:
- State "DONE"       from "TODO"       [2015-10-06 Tue 20:43]
- State "DONE"       from "TODO"       [2015-09-21 Mon 16:14]
- State "DONE"       from "TODO"       [2015-09-10 Thu 09:41]
- State "DONE"       from "TODO"       [2015-09-01 Tue 10:33]
- State "DONE"       from "TODO"       [2015-08-25 Tue 11:37]
- State "DONE"       from "TODO"       [2015-08-18 Tue 13:35]
- State "DONE"       from "TODO"       [2015-08-11 Tue 08:52]
- State "DONE"       from "TODO"       [2015-08-04 Tue 09:16]
- State "DONE"       from "TODO"       [2015-07-28 Tue 07:49]
- State "DONE"       from "TODO"       [2015-07-21 Tue 09:34]
- State "DONE"       from "TODO"       [2015-07-14 Tue 17:23]
- State "DONE"       from "TODO"       [2015-07-07 Tue 13:59]
- State "DONE"       from "TODO"       [2015-06-30 Tue 09:23]
- State "DONE"       from "TODO"       [2015-06-23 Tue 09:42]
- State "DONE"       from "TODO"       [2015-06-16 Tue 08:54]
- State "DONE"       from "TODO"       [2015-06-09 Tue 11:48]
- State "DONE"       from "TODO"       [2015-06-01 Mon 23:02]
- State "DONE"       from "TODO"       [2015-05-25 Mon 09:36]
- State "DONE"       from "TODO"       [2015-05-08 Fri 15:19]
- State "DONE"       from "TODO"       [2015-05-01 Fri 12:42]
- State "DONE"       from "TODO"       [2014-04-07 Mon 20:00]
- State "DONE"       from "STARTED"    [2014-03-29 Sat 10:11]
:PROPERTIES:
:LAST_REPEAT: [2015-08-25 Tue 11:37]
:END:
** DONE GTD weekly Review
CLOSED: [2015-10-18 Sun 13:58]
- State "DONE"       from "TODO"       [2015-10-18 Sun 13:58]
- Archive all the Done items.
- Adjust the Todo item's priority.
- Refile some tasks.
SCHEDULED: <2015-10-18 15:00-15:30 Sun .6d/7d>

* Monthly Tasks                                                     :Monthly:
#+category: Monthly
** TODO Write a article to summary the fruit of a month               :LIFE:
SCHEDULED: <2015-11-14 Sat .+30d/31d>
:PROPERTIES:
:LAST_REPEAT: [2015-10-15 Thu 22:33]
:END:
- State "DONE"       from "TODO"       [2015-10-15 Thu 22:33]
- State "DONE"       from "TODO"       [2015-09-05 Sat 23:39]
- State "DONE"       from "TODO"       [2015-08-12 Wed 11:31]
- State "DONE"       from "TODO"       [2015-07-13 Mon 09:31]
- State "DONE"       from "TODO"       [2015-05-08 Fri 15:20]
   - State "DONE"       from "TODO"       [2015-01-19 Mon 09:35]
   - State "DONE"       from "TODO"       [2014-12-16 Tue 14:24]
   - State "DONE"       from "STARTED"    [2014-09-30 Tue 09:39]
   - State "DONE"       from "TODO"       [2014-08-27 Wed 09:53]
   - State "DONE"       from "TODO"       [2014-07-15 Tue 17:42]
   - State "DONE"       from "STARTED"    [2014-05-14 Wed 10:43]
   - State "DONE"       from "STARTED"    [2014-03-30 Sun 22:43]
   :LOGBOOK:
   CLOCK: [2014-09-30 Tue 08:23]--[2014-09-30 Tue 08:49] =>  0:26
   CLOCK: [2014-05-14 Wed 10:13]--[2014-05-14 Wed 10:38] =>  0:25
   CLOCK: [2014-03-30 Sun 22:37]--[2014-03-30 Sun 22:43] =>  0:06
   CLOCK: [2014-03-30 Sun 22:14]--[2014-03-30 Sun 22:26] =>  0:12
   :END:
:PROPERTIES:
:LAST_REPEAT: [2015-08-12 Wed 11:31]
:END:

* Daily Review
#+BEGIN: clocktable :maxlevel 5 :scope agenda-with-archives :block today :fileskip0 t :indent t
#+CAPTION: Clock summary at [2015-10-17 Sat 22:16], for Saturday, October 17, 2015.
| File    | Headline                                     | Time    |       |
|---------+----------------------------------------------+---------+-------|
|         | ALL *Total time*                             | *13:33* |       |
|---------+----------------------------------------------+---------+-------|
| gtd.org | *File time*                                  | *13:33* |       |
|         | Daily Tasks                                  | 12:29   |       |
|         | \_  TODO Visit Reddit                        |         |  0:25 |
|         | \_  TODO Read RSS half an  hour              |         | 11:36 |
|         | \_  STARTED Do exercise for 30 minutes       |         |  0:03 |
|         | \_  TODO Do exercise for 30 minutes          |         |  0:25 |
|         | Weekly Tasks                                 | 1:04    |       |
|         | \_  TODO [#B]  Record a Spacemacs rocks...   |         |  0:06 |
|         | \_  DONE Review the TODO items, move C to... |         |  0:58 |
#+END:

#+BEGIN_SRC emacs-lisp :results value
;; (setq week-range (org-clock-special-range 'today nil t))
;; (org-clock-sum-today-by-tags nil (nth 0 week-range) (nth 1 week-range) t)
#+END_SRC

#+RESULTS:


# The following section is used for Weekly Review
* Weekly Review
#+BEGIN: clocktable :maxlevel 5 :scope agenda-with-archives :block thisweek :fileskip0 t :indent t
#+CAPTION: Clock summary at [2015-10-17 Sat 22:16], for week 2015-W42.
| File              | Headline                                       | Time       |       |       |
|-------------------+------------------------------------------------+------------+-------+-------|
|                   | ALL *Total time*                               | *2d 18:59* |       |       |
|-------------------+------------------------------------------------+------------+-------+-------|
| gtd.org           | *File time*                                    | *2d 15:32* |       |       |
|                   | FireBall                                       | 5:42       |       |       |
|                   | \_  STARTED [#A] 融合 Sale9Sprite 到 Sprite 中 |            |  5:42 |       |
|                   | \_    Hacking the draw method.                 |            |       |  2:22 |
|                   | Zilongshanren                                  | 15:11      |       |       |
|                   | \_  Reading                                    |            | 15:11 |       |
|                   | \_    STARTED [#B]  Learn Javascript [0%]      |            |       | 14:46 |
|                   | \_    TODO Learn WebGL and Graphics [0%]       |            |       |  0:25 |
|                   | Daily Tasks                                    | 1d 17:35   |       |       |
|                   | \_  DONE c/c++ enable ycmd and binding...      |            |  0:27 |       |
|                   | \_  TODO Visit Reddit                          |            |  2:32 |       |
|                   | \_  TODO Read RSS half an  hour                |            | 22:52 |       |
|                   | \_  DONE [#A] Create a file-browser package    |            |  1:15 |       |
|                   | \_  STARTED Do exercise for 30 minutes         |            | 11:27 |       |
|                   | \_  TODO Do exercise for 30 minutes            |            |  2:12 |       |
|                   | \_  DONE Learn literal programming of...       |            |  0:25 |       |
|                   | \_  DONE Read a article about how to...        |            |  0:25 |       |
|                   | Weekly Tasks                                   | 1:04       |       |       |
|                   | \_  TODO [#B]  Record a Spacemacs rocks...     |            |  0:06 |       |
|                   | \_  DONE Review the TODO items, move C to...   |            |  0:58 |       |
|-------------------+------------------------------------------------+------------+-------+-------|
| notes.org         | *File time*                                    | *1:47*     |       |       |
|                   | Quick notes                                    | 1:47       |       |       |
|                   | \_  TODO Learn DOM manipulate [16%]            |            |  1:47 |       |
|-------------------+------------------------------------------------+------------+-------+-------|
| notes.org_archive | *File time*                                    | *1:40*     |       |       |
|                   | DONE Learn mocha node.js test...               | 1:40       |       |       |
#+END:

#+BEGIN_SRC emacs-lisp :results value
  (setq week-range (org-clock-special-range 'thisweek nil t))
  (org-clock-sum-today-by-tags nil (nth 0 week-range) (nth 1 week-range) t)
#+END_SRC

#+RESULTS:
: [-WORK-] 04:11
: [-LIFE-] 00:25


# The following section is used for Monthly Review
* Monthly Review
#+BEGIN: clocktable :maxlevel 5 :scope agenda-with-archives :block thismonth :fileskip0 t :indent t
#+CAPTION: Clock summary at [2015-10-17 Sat 22:16], for October 2015.
| File              | Headline                                       |       Time |       |       |
|-------------------+------------------------------------------------+------------+-------+-------|
|                   | ALL *Total time*                               | *3d 11:35* |       |       |
|-------------------+------------------------------------------------+------------+-------+-------|
| gtd.org           | *File time*                                    |  *3d 3:33* |       |       |
|                   | FireBall                                       |       5:42 |       |       |
|                   | \_  STARTED [#A] 融合 Sale9Sprite 到 Sprite 中 |            |  5:42 |       |
|                   | \_    Hacking the draw method.                 |            |       |  2:22 |
|                   | Zilongshanren                                  |      21:21 |       |       |
|                   | \_  Reading                                    |            | 21:21 |       |
|                   | \_    STARTED [#B]  Learn Javascript [0%]      |            |       | 20:56 |
|                   | \_    TODO Learn WebGL and Graphics [0%]       |            |       |  0:25 |
|                   | Daily Tasks                                    |   1d 23:26 |       |       |
|                   | \_  DONE c/c++ enable ycmd and binding...      |            |  0:27 |       |
|                   | \_  TODO Visit Reddit                          |            |  3:47 |       |
|                   | \_  TODO Read RSS half an  hour                |            | 23:17 |       |
|                   | \_  DONE [#A] Create a file-browser package    |            |  4:36 |       |
|                   | \_  STARTED Do exercise for 30 minutes         |            | 11:52 |       |
|                   | \_  TODO Do exercise for 30 minutes            |            |  2:37 |       |
|                   | \_  DONE Learn literal programming of...       |            |  0:25 |       |
|                   | \_  DONE Read a article about how to...        |            |  0:25 |       |
|                   | Weekly Tasks                                   |       1:04 |       |       |
|                   | \_  TODO [#B]  Record a Spacemacs rocks...     |            |  0:06 |       |
|                   | \_  DONE Review the TODO items, move C to...   |            |  0:58 |       |
|-------------------+------------------------------------------------+------------+-------+-------|
| gtd.org_archive   | *File time*                                    |     *0:25* |       |       |
|                   | DONE Add Chrome refresh function from...       |       0:25 |       |       |
|-------------------+------------------------------------------------+------------+-------+-------|
| notes.org         | *File time*                                    |     *1:47* |       |       |
|                   | Quick notes                                    |       1:47 |       |       |
|                   | \_  TODO Learn DOM manipulate [16%]            |            |  1:47 |       |
|-------------------+------------------------------------------------+------------+-------+-------|
| notes.org_archive | *File time*                                    |     *5:50* |       |       |
|                   | DONE Learn mocha node.js test...               |       1:40 |       |       |
|                   | DONE Learn Unity UI                            |       4:10 |       |       |
#+END:

#+BEGIN_SRC emacs-lisp :results value
(setq week-range (org-clock-special-range 'thismonth nil t))
(org-clock-sum-today-by-tags nil (nth 0 week-range) (nth 1 week-range) t)
#+END_SRC

#+RESULTS:
: [-WORK-] 04:11
: [-LIFE-] 00:25

* Cocos2D-X
** DONE [#B]  修复 Scale9Sprite 进度条缩放的问题                      :WORK:
CLOSED: [2015-10-25 Sun 22:44]
- State "DONE"       from "STARTED"    [2015-10-25 Sun 22:44]
** TODO [#C] 重写 Win32 的 EditBox                                    :WORK:
[[http://stackoverflow.com/questions/978632/how-do-i-create-a-normal-win32-edit-control][c - How do I create a normal win32 edit control? - Stack Overflow]]
[[https://msdn.microsoft.com/en-us/library/windows/desktop/hh298433(v%3Dvs.85).aspx][How to Create a Multiline Edit Control (Windows)]]
[[http://www.win32developer.com/tutorial/windows/windows_tutorial_3.shtm][Win32 Developer - Tutorial 3 Using edit boxes, buttons, and other window asset using the Win32 API]]
[[https://msdn.microsoft.com/en-us/library/bb773169(VS.85).aspx][Control Library (Windows)]]
